In [1]:
import sqlite3

In [2]:
conexao = sqlite3.connect('banco')
cursor = conexao.cursor()

## Exercício 1
Crie uma tabela chamada "alunos" com os seguintes campos: id(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [3]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(20))')

OperationalError: table alunos already exists

## Exercício 2
Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [4]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (1, "Maria", 20, "Química"), \
(2, "José", 28, "Direito"), (3, "Carla", 15, "Letras"), (4, "Luísa", 35, "Medicina"), \
(5, "Pedro", 40, "Contabilidade")')

In [5]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (6, "Vinícius", 20, "Engenharia"), \
(7, "Leandro", 22, "Física"), (8, "Lívia", 32, "Arquitetura"), (9, "Sheila", 24, "Engenharia"), \
(10, "Paulo", 43, "Economia")')

## Exercício 3
Consultas Básicas - 
Escreva consultas SQL para realizar as seguintes tarefas:
<br>a) Selecionar todos os registros da tabela "alunos".
<br>b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
<br>c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.
<br>d) Contar o número total de alunos na tabela

In [6]:
dados = cursor.execute('SELECT * FROM alunos')
for i in dados:
    print(i)

(1, 'Maria', 20, 'Química')
(2, 'José', 28, 'Direito')
(3, 'Carla', 15, 'Letras')
(4, 'Luísa', 35, 'Medicina')
(5, 'Pedro', 40, 'Contabilidade')
(6, 'Vinícius', 20, 'Engenharia')
(7, 'Leandro', 22, 'Física')
(8, 'Lívia', 32, 'Arquitetura')
(9, 'Sheila', 24, 'Engenharia')
(10, 'Paulo', 43, 'Economia')

In [7]:
dados = cursor.execute('SELECT nome, idade FROM alunos WHERE idade>20')

for i in dados:
    print(i)

('José', 28)
('Luísa', 35)
('Pedro', 40)
('Leandro', 22)
('Lívia', 32)
('Sheila', 24)
('Paulo', 43)

In [8]:
dados = cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome')

for i in dados:
    print(i)

(9, 'Sheila', 24, 'Engenharia')
(6, 'Vinícius', 20, 'Engenharia')

In [9]:
contagem = cursor.execute('SELECT COUNT(*) FROM alunos')

for i in contagem:
    print(i)

(10,)

## Exercício 4
Atualização e Remoção
<br>a) Atualize a idade de um aluno específico na tabela.
<br>b) Remova um aluno pelo seu ID.

In [10]:
cursor.execute('UPDATE alunos SET idade=19 WHERE nome="Pedro"')
dados = cursor.execute('SELECT * FROM alunos')

for i in dados:
    print(i)

(1, 'Maria', 20, 'Química')
(2, 'José', 28, 'Direito')
(3, 'Carla', 15, 'Letras')
(4, 'Luísa', 35, 'Medicina')
(5, 'Pedro', 19, 'Contabilidade')
(6, 'Vinícius', 20, 'Engenharia')
(7, 'Leandro', 22, 'Física')
(8, 'Lívia', 32, 'Arquitetura')
(9, 'Sheila', 24, 'Engenharia')
(10, 'Paulo', 43, 'Economia')

In [11]:
cursor.execute('DELETE FROM alunos WHERE id=4')

dados = cursor.execute('SELECT * FROM alunos')

for i in dados:
    print(i)

(1, 'Maria', 20, 'Química')
(2, 'José', 28, 'Direito')
(3, 'Carla', 15, 'Letras')
(5, 'Pedro', 19, 'Contabilidade')
(6, 'Vinícius', 20, 'Engenharia')
(7, 'Leandro', 22, 'Física')
(8, 'Lívia', 32, 'Arquitetura')
(9, 'Sheila', 24, 'Engenharia')
(10, 'Paulo', 43, 'Economia')

## Exercício 5
Criar uma Tabela e Inserir Dados
<br>Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [12]:
cursor.execute('CREATE TABLE clientes(id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT)')

In [13]:
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (1, "Maria", 20, 1500.00), \
(2, "José", 28, 6000.00), (3, "Carla", 15, 800.00), (4, "Luísa", 35, 10000.00), \
(5, "Pedro", 40, 6500.00),(6, "Vinícius", 20, 2500.00), \
(7, "Leandro", 22, 4000.00), (8, "Lívia", 32, 850.00), (9, "Sheila", 24, 1100.00), \
(10, "Paulo", 43, 25000.00)')

In [14]:
dados = cursor.execute('SELECT * FROM clientes')

for i in dados:
    print(i)

(1, 'Maria', 20, 1500.0)
(2, 'José', 28, 6000.0)
(3, 'Carla', 15, 800.0)
(4, 'Luísa', 35, 10000.0)
(5, 'Pedro', 40, 6500.0)
(6, 'Vinícius', 20, 2500.0)
(7, 'Leandro', 22, 4000.0)
(8, 'Lívia', 32, 850.0)
(9, 'Sheila', 24, 1100.0)
(10, 'Paulo', 43, 25000.0)

## Exercício 6
Consultas e Funções Agregadas
<br>Escreva consultas SQL para realizar as seguintes tarefas:
<br>a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.
<br>b) Calcule o saldo médio dos clientes.
<br>c) Encontre o cliente com o saldo máximo.
<br>d) Conte quantos clientes têm saldo acima de 1000.

In [15]:
dados = cursor.execute('SELECT nome, idade FROM clientes WHERE idade>30')

for i in dados:
    print(i)

('Luísa', 35)
('Pedro', 40)
('Lívia', 32)
('Paulo', 43)

In [16]:
saldo_medio = cursor.execute('SELECT AVG(saldo) FROM clientes')

for i in saldo_medio:
    print(i)

(5825.0,)

In [17]:
saldo_max = cursor.execute('SELECT nome, MAX(saldo) FROM clientes')

for i in saldo_max:
    print(i)

('Paulo', 25000.0)

In [18]:
saldo_acima_1000 = cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo>1000.00')

for i in saldo_acima_1000:
    print(i)

(8,)

## Exercício 7
Atualização e Remoção com Condições
<br>a) Atualize o saldo de um cliente específico.
<br>b) Remova um cliente pelo seu ID.

In [19]:
cursor.execute('UPDATE clientes SET saldo=3000.00 WHERE nome="Leandro"')

In [20]:
cursor.execute('DELETE FROM clientes WHERE id=6')

In [21]:
dados = cursor.execute('SELECT * FROM clientes')

for i in dados:
    print(i)

(1, 'Maria', 20, 1500.0)
(2, 'José', 28, 6000.0)
(3, 'Carla', 15, 800.0)
(4, 'Luísa', 35, 10000.0)
(5, 'Pedro', 40, 6500.0)
(7, 'Leandro', 22, 3000.0)
(8, 'Lívia', 32, 850.0)
(9, 'Sheila', 24, 1100.0)
(10, 'Paulo', 43, 25000.0)

## Exercício 8
Junção de Tabelas
<br>Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [22]:
#cursor.execute('CREATE TABLE compras(id INT, cliente_id INT, FOREIGN KEY(cliente_id) REFERENCES clientes(id)) produto VARCHAR(30), valor FLOAT')
cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto TEXT, valor REAL, FOREIGN KEY (cliente_id) REFERENCES clientes(id))')

In [24]:
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (1, 1, "estojo", 15.00), \
(2, 2, "caderno", 30.00), (3, 4, "celular", 1800.00), (4, 4, "livro", 100.00), \
(5, 5, "teclado", 150.00),(6, 7, "mouse", 50.00), \
(7, 9, "violão", 300.00), (8, 10, "notebook", 3850.00), (9, 10, "mochila", 200.00), \
(10, 10, "relógio", 300.00)')

In [25]:
dados = cursor.execute('SELECT * FROM compras')
for i in dados:
    print(i)

(1, 1, 'estojo', 15.0)
(2, 2, 'caderno', 30.0)
(3, 4, 'celular', 1800.0)
(4, 4, 'livro', 100.0)
(5, 5, 'teclado', 150.0)
(6, 7, 'mouse', 50.0)
(7, 9, 'violão', 300.0)
(8, 10, 'notebook', 3850.0)
(9, 10, 'mochila', 200.0)
(10, 10, 'relógio', 300.0)

In [35]:
dados_join = dados = cursor.execute('SELECT c.nome, p.produto, p.valor FROM compras p JOIN clientes c ON p.cliente_id = c.id')

for i in dados_join:
    print(i)

('Maria', 'estojo', 15.0)
('José', 'caderno', 30.0)
('Luísa', 'celular', 1800.0)
('Luísa', 'livro', 100.0)
('Pedro', 'teclado', 150.0)
('Leandro', 'mouse', 50.0)
('Sheila', 'violão', 300.0)
('Paulo', 'notebook', 3850.0)
('Paulo', 'mochila', 200.0)
('Paulo', 'relógio', 300.0)

In [30]:
conexao.commit()
conexao.close